[
      {
        "tag": "greeting",
        "patterns": ["Hello", "Hi", "Hey", "Good morning", "Good evening", "Hi there"],
        "responses": ["Hello! How can I assist you today?", "Hi there! How can I help?", "Hey! What do you need help with?"]
      },
      {
        "tag": "goodbye",
        "patterns": ["Bye", "Goodbye", "See you later", "Take care", "Catch you later"],
        "responses": ["Goodbye! Have a great day!", "See you later!", "Take care!"]
      },
      {
        "tag": "thanks",
        "patterns": ["Thanks", "Thank you", "Thanks a lot", "I appreciate it", "Thanks for helping"],
        "responses": ["You're welcome!", "Happy to help!", "Anytime! Let me know if you need anything else."]
      },
      {
        "tag": "help_request",
        "patterns": ["I need help", "Can you help me?", "I have a problem", "Can you guide me?", "I’m stuck"],
        "responses": ["Sure! What do you need help with?", "Of course! Tell me more about the problem.", "I’m here to help. Please explain your issue."]
      },
          {
            "tag": "morning_routine",
            "patterns": ["What should I do in the morning?", "Tell me a good morning routine", "Morning activities?", "What do people do in the morning?"],
            "responses": [
              "Start your morning with a glass of water to hydrate. Then, try some light stretching or a short workout, followed by a healthy breakfast.",
              "A productive morning routine might include meditation, journaling, or setting goals for the day.",
              "Begin your day by making your bed, getting fresh air, and preparing a nutritious meal."
            ]
          },
          {
            "tag": "exercise",
            "patterns": ["What exercise should I do?", "Tell me an exercise routine", "How should I work out?", "Give me some fitness tips"],
            "responses": [
              "For beginners, try a 15-minute walk or some light yoga. As you progress, include strength training or cardio.",
              "You can start with simple bodyweight exercises like push-ups, squats, and planks.",
              "Always remember to warm up before exercising and cool down afterward to prevent injuries."
            ]
          },
          {
            "tag": "mealtime",
            "patterns": ["What should I eat?", "Suggestions for lunch?", "Tell me a healthy dinner", "What’s a good meal idea?"],
            "responses": [
              "For breakfast, try oatmeal with fruits or a protein smoothie. Lunch could be grilled chicken with veggies, and dinner a light salad or soup.",
              "Include a balance of protein, carbs, and healthy fats in your meals. Snack on nuts or fruits when hungry.",
              "Meal prep can save time. Prepare simple dishes like rice bowls, wraps, or pasta with vegetables."
            ]
          },
          {
            "tag": "work_productivity",
            "patterns": ["How can I focus on work?", "Give me productivity tips", "How to avoid procrastination?", "Help me be more productive"],
            "responses": [
              "Start by breaking your tasks into smaller, manageable steps and prioritizing them.",
              "Use time management techniques like the Pomodoro technique to stay focused.",
              "Minimize distractions by keeping your workspace organized and turning off unnecessary notifications."
            ]
          },
          {
            "tag": "relaxation",
            "patterns": ["How can I relax?", "What to do when I’m stressed?", "Give me relaxation tips", "How do I unwind?"],
            "responses": [
              "Try deep breathing exercises or listen to calming music to relax.",
              "A short walk in nature or practicing mindfulness can reduce stress effectively.",
              "Spend time on hobbies you enjoy, like reading, drawing, or gardening."
            ]
          },
          {
            "tag": "night_routine",
            "patterns": ["What’s a good night routine?", "How should I prepare for sleep?", "Nighttime activities?", "How to sleep better?"],
            "responses": [
              "Wind down by avoiding screens an hour before bed and reading or journaling instead.",
              "Prepare for a good night’s sleep by dimming the lights and practicing relaxation techniques.",
              "Create a bedtime routine, like skincare, setting your clothes for the next day, and meditating."
            ]
          },
          {
            "tag": "time_management",
            "patterns": ["How do I manage my time?", "Give me time management tips", "How can I organize my day?", "Help me plan my schedule"],
            "responses": [
              "Start by creating a to-do list and prioritizing tasks. Allocate time for breaks as well.",
              "Use a planner or digital calendar to schedule tasks and set reminders.",
              "Focus on one task at a time to improve efficiency and avoid multitasking."
            ]
          },
          {
            "tag": "healthy_habits",
            "patterns": ["How do I build healthy habits?", "What are good daily habits?", "Suggest some healthy routines", "Give me tips for a healthy lifestyle"],
            "responses": [
              "Drink plenty of water, eat balanced meals, and get at least 7-8 hours of sleep daily.",
              "Incorporate exercise, mindfulness, and gratitude into your routine.",
              "Limit screen time, avoid excessive caffeine or sugar, and stick to a consistent schedule."
            ]
          },
              {
                "tag": "sports_info",
                "patterns": ["Tell me about sports", "What are popular sports?", "Name some sports", "Give me a list of sports"],
                "responses": [
                  "Popular sports include football (soccer), basketball, cricket, tennis, baseball, and athletics.",
                  "Some sports people enjoy are swimming, hockey, volleyball, golf, and badminton.",
                  "There are many sports, from team games like rugby to individual ones like running or cycling. Which one interests you?"
                ]
              },
              {
                "tag": "football",
                "patterns": ["Tell me about football", "What is soccer?", "Rules of football", "What’s football about?"],
                "responses": [
                  "Football, also known as soccer, is a team sport played between two teams of 11 players with a spherical ball. The objective is to score goals by getting the ball into the opponent's net.",
                  "Football is played on a rectangular field with goals at each end. It's the most popular sport in the world.",
                  "In football, the game lasts for 90 minutes, split into two halves of 45 minutes each. Would you like to know about famous players or teams?"
                ]
              },
              {
                "tag": "cricket",
                "patterns": ["Tell me about cricket", "What is cricket?", "Rules of cricket", "How is cricket played?"],
                "responses": [
                  "Cricket is a bat-and-ball game played between two teams of 11 players. It involves batting, bowling, and fielding.",
                  "In cricket, one team bats to score runs while the other bowls and fields to restrict runs and dismiss players. Matches can last from a few hours to five days!",
                  "Famous cricket formats include Test matches, One-Day Internationals (ODIs), and T20 games. Would you like to know more?"
                ]
              },
              {
                "tag": "basketball",
                "patterns": ["Tell me about basketball", "What are the rules of basketball?", "How is basketball played?", "Explain basketball"],
                "responses": [
                  "Basketball is a fast-paced game played on a court where two teams of five players each try to score points by throwing a ball through the opponent's hoop.",
                  "In basketball, the team with the most points at the end of the game wins. The game consists of four quarters of 10 or 12 minutes each.",
                  "Some of the greatest basketball players include Michael Jordan, LeBron James, and Kobe Bryant. Are you interested in NBA history?"
                ]
              },
              {
                "tag": "tennis",
                "patterns": ["Tell me about tennis", "What is tennis?", "How do you play tennis?", "Rules of tennis"],
                "responses": [
                  "Tennis is a racket sport where players hit a ball over a net into the opponent's court. Points are scored when the opponent can't return the ball.",
                  "Tennis can be played in singles (one player on each side) or doubles (two players on each side). It’s played on grass, clay, or hard courts.",
                  "Famous tennis players include Roger Federer, Serena Williams, and Rafael Nadal. Would you like to know about tennis tournaments?"
                ]
              },
              {
                "tag": "equipment",
                "patterns": ["What equipment is used in sports?", "Sports gear", "Tell me about sports equipment", "What do I need for sports?"],
                "responses": [
                  "Different sports require different equipment. For example, football needs a ball and cleats, while cricket requires a bat, ball, and pads.",
                  "Basketball needs a hoop and a ball, while tennis requires a racket and a court. For swimming, you’ll need swimwear and goggles.",
                  "Would you like details about specific equipment for a sport you’re interested in?"
                ]
              },
              {
                "tag": "sports_history",
                "patterns": ["Tell me the history of sports", "When did sports start?", "History of popular sports", "Where did sports originate?"],
                "responses": [
                  "Sports date back thousands of years, with early evidence from ancient Greece and Egypt. The Olympics originated in Greece in 776 BC.",
                  "Modern sports like football, cricket, and tennis developed in the 19th century. Football was codified in England, while cricket gained popularity in the British Empire.",
                  "The NBA was founded in 1946, and the first modern Olympics took place in 1896. Would you like more details about a specific sport's history?"
                ]
              },
              {
                "tag": "fitness_and_sports",
                "patterns": ["How does sports improve fitness?", "Benefits of sports", "Is playing sports healthy?", "How does sports help health?"],
                "responses": [
                  "Playing sports improves cardiovascular health, strengthens muscles, and enhances flexibility.",
                  "Sports help with mental health by reducing stress and boosting mood through endorphins.",
                  "Being active in sports builds teamwork, discipline, and leadership skills while keeping you fit."
                ]
              },
              {
                "tag": "olympics",
                "patterns": ["Tell me about the Olympics", "What are the Olympic Games?", "History of the Olympics", "Olympic sports"],
                "responses": [
                  "The Olympics are a global sporting event held every four years, featuring sports like athletics, swimming, and gymnastics.",
                  "The modern Olympics began in 1896, inspired by ancient Greek games. The Winter Olympics focus on ice and snow sports.",
                  "The Olympic motto is 'Citius, Altius, Fortius' (Faster, Higher, Stronger). Would you like to know about famous athletes or Olympic records?"
                ]
              },
              {
                "tag": "famous_athletes",
                "patterns": ["Who are famous athletes?", "Tell me about sports legends", "Famous players", "Who are the best athletes?"],
                "responses": [
                  "Famous athletes include Lionel Messi and Cristiano Ronaldo in football, Serena Williams in tennis, and Usain Bolt in athletics.",
                  "In basketball, Michael Jordan and LeBron James are legends, while Sachin Tendulkar is a cricket icon.",
                  "Are you looking for athletes from a specific sport or era?"
                ]
              },
              {
                    "tag": "programming_languages",
                    "patterns": ["What are programming languages?", "Tell me about programming languages", "List some programming languages", "What programming languages should I learn?"],
                    "responses": [
                      "Programming languages are used to write software. Popular languages include Python, JavaScript, Java, C++, Ruby, and Go.",
                      "Some languages are better for web development (like JavaScript), while others are used for system programming (like C). Python is great for data science and automation.",
                      "Choose a language based on what you want to do. For example, learn JavaScript for web apps, Python for data science, or C++ for game development."
                    ]
                  },
                  {
                    "tag": "web_development",
                    "patterns": ["What is web development?", "Tell me about web development", "How to build websites?", "What do I need to know for web development?"],
                    "responses": [
                      "Web development involves building websites or web applications. It includes front-end development (UI/UX) and back-end development (server-side).",
                      "For front-end, you need to learn HTML, CSS, and JavaScript. For back-end, consider learning languages like Python, Node.js, or Ruby.",
                      "Modern frameworks like React, Vue.js, and Angular help with front-end development, while Flask, Django, and Express are popular for back-end."
                    ]
                  },
                  {
                    "tag": "databases",
                    "patterns": ["What is a database?", "Tell me about databases", "What is SQL?", "What are NoSQL databases?"],
                    "responses": [
                      "A database is a collection of data that can be stored and accessed electronically. SQL (Structured Query Language) is used for managing relational databases.",
                      "Popular databases include MySQL, PostgreSQL, and SQLite (SQL databases), and MongoDB and Firebase (NoSQL databases).",
                      "NoSQL databases are non-relational and are better suited for flexible, unstructured data, while SQL databases are more structured."
                    ]
                  },
                  {
                    "tag": "debugging",
                    "patterns": ["How do I debug my code?", "What is debugging?", "Tell me how to fix bugs in my code", "Why is debugging important?"],
                    "responses": [
                      "Debugging is the process of identifying and fixing errors (bugs) in your code. Use print statements or logging to track your code’s flow and find issues.",
                      "Modern IDEs (Integrated Development Environments) have built-in debuggers, which allow you to step through your code, check variable values, and locate bugs.",
                      "Some common debugging techniques include checking syntax errors, using breakpoints, and reviewing the stack trace for runtime errors."
                    ]
                  },
                  {
                    "tag": "version_control",
                    "patterns": ["What is version control?", "Tell me about Git", "How does version control work?", "What is GitHub?"],
                    "responses": [
                      "Version control is a system that helps manage changes to your code over time. Git is the most widely used version control system.",
                      "GitHub is a platform that hosts Git repositories and enables collaboration between developers.",
                      "With version control, you can track changes, revert to previous versions, and collaborate with others without overwriting each other's work."
                    ]
                  },
                  {
                    "tag": "algorithms",
                    "patterns": ["What are algorithms?", "Tell me about algorithms", "What is sorting algorithm?", "What is the difference between searching and sorting?"],
                    "responses": [
                      "An algorithm is a step-by-step procedure used for solving a problem or performing a task. Common algorithms include sorting, searching, and traversal.",
                      "Sorting algorithms like Bubble Sort and Quick Sort organize data in a specific order, while searching algorithms like Binary Search help find data in a collection.",
                      "The choice of algorithm affects performance, such as time complexity (how long it takes) and space complexity (how much memory it uses)."
                    ]
                  },
                  {
                    "tag": "object_oriented_programming",
                    "patterns": ["What is object-oriented programming?", "Explain OOP", "What are the principles of OOP?", "What is inheritance in OOP?"],
                    "responses": [
                      "Object-Oriented Programming (OOP) is a programming paradigm based on the concept of 'objects', which can contain data and methods.",
                      "The four main principles of OOP are Encapsulation, Abstraction, Inheritance, and Polymorphism.",
                      "Inheritance allows you to create new classes that are based on existing ones. For example, a 'Car' class can inherit from a 'Vehicle' class."
                    ]
                  },
                  {
                    "tag": "software_engineering",
                    "patterns": ["What is software engineering?", "Explain software development", "What are software development methodologies?", "What is agile development?"],
                    "responses": [
                      "Software engineering is the application of engineering principles to software development, including design, testing, and maintenance.",
                      "Popular software development methodologies include Agile, Scrum, Waterfall, and DevOps. Agile is known for iterative development and flexibility.",
                      "Software engineers work on creating and improving software systems, focusing on performance, reliability, and scalability."
                    ]
                  },
                  {
                    "tag": "data_science",
                    "patterns": ["What is data science?", "Tell me about data science", "What tools are used in data science?", "How can I become a data scientist?"],
                    "responses": [
                      "Data science is the field that combines statistics, data analysis, and machine learning to extract insights from structured and unstructured data.",
                      "Common tools used in data science include Python (with libraries like pandas, NumPy, and Scikit-learn), R, and tools like Jupyter Notebooks.",
                      "To become a data scientist, you need strong skills in mathematics, programming, and data analysis, along with knowledge of machine learning and data visualization."
                    ]
                  },
                  {
                    "tag": "best_practices",
                    "patterns": ["What are coding best practices?", "How do I write clean code?", "What is code refactoring?", "How do I improve my coding skills?"],
                    "responses": [
                      "Coding best practices include writing clear, readable code, using meaningful variable names, and adding comments for clarification.",
                      "Code refactoring involves restructuring existing code to improve its readability, efficiency, and maintainability without changing its functionality.",
                      "To improve coding skills, practice consistently, read others' code, participate in coding challenges, and learn from debugging and code reviews."
                    ]
                  },
                      {
                        "tag": "emerging_technologies",
                        "patterns": ["What are emerging technologies?", "Tell me about new technologies", "What are the latest technologies?", "What is the future of technology?"],
                        "responses": [
                          "Emerging technologies include artificial intelligence (AI), blockchain, quantum computing, 5G, and augmented reality (AR).",
                          "Some technologies shaping the future are autonomous vehicles, drones, and biotechnology.",
                          "Quantum computing promises to solve problems that are currently impossible for classical computers, while AI is transforming industries like healthcare, finance, and entertainment."
                        ]
                      },
                      {
                        "tag": "artificial_intelligence",
                        "patterns": ["What is AI?", "Tell me about artificial intelligence", "How does AI work?", "What are the types of AI?"],
                        "responses": [
                          "Artificial Intelligence (AI) refers to the simulation of human intelligence processes by machines, especially computer systems.",
                          "AI includes tasks like learning (machine learning), reasoning, problem-solving, perception, and language understanding.",
                          "There are two main types of AI: narrow AI (designed to perform specific tasks, like voice assistants) and general AI (which aims to perform any cognitive task a human can do)."
                        ]
                      },
                      {
                        "tag": "machine_learning",
                        "patterns": ["What is machine learning?", "Explain machine learning", "How does machine learning work?", "What are the types of machine learning?"],
                        "responses": [
                          "Machine learning is a subset of AI that allows systems to learn and improve from experience without being explicitly programmed.",
                          "Machine learning involves training models on large datasets to make predictions or decisions. Types of machine learning include supervised, unsupervised, and reinforcement learning.",
                          "Supervised learning uses labeled data, unsupervised learning finds patterns in unlabeled data, and reinforcement learning uses rewards to guide decisions."
                        ]
                      },
                      {
                        "tag": "cloud_computing",
                        "patterns": ["What is cloud computing?", "Tell me about cloud technology", "How does cloud computing work?", "What are cloud services?"],
                        "responses": [
                          "Cloud computing involves delivering computing services like storage, processing, and networking over the internet (the cloud) instead of on-premises.",
                          "Popular cloud platforms include Amazon Web Services (AWS), Microsoft Azure, and Google Cloud. These platforms offer scalable storage, computing power, and various tools.",
                          "Cloud services are categorized as Infrastructure as a Service (IaaS), Platform as a Service (PaaS), and Software as a Service (SaaS)."
                        ]
                      },
                      {
                        "tag": "internet_of_things",
                        "patterns": ["What is IoT?", "Tell me about the Internet of Things", "How does IoT work?", "What are some IoT devices?"],
                        "responses": [
                          "The Internet of Things (IoT) refers to the network of physical devices that are connected to the internet and can communicate with each other.",
                          "Common IoT devices include smart thermostats, wearable fitness trackers, smart refrigerators, and connected home security systems.",
                          "IoT has applications in industries like healthcare, agriculture, and logistics, improving automation and data collection."
                        ]
                      },
                      {
                        "tag": "blockchain",
                        "patterns": ["What is blockchain?", "Tell me about blockchain technology", "How does blockchain work?", "What are the uses of blockchain?"],
                        "responses": [
                          "Blockchain is a decentralized digital ledger that records transactions across multiple computers, ensuring that records are secure and transparent.",
                          "Blockchain is best known as the technology behind cryptocurrencies like Bitcoin, but it can also be used for secure transactions in fields like supply chain, voting, and identity verification.",
                          "The key feature of blockchain is its security and immutability, as once data is added to the blockchain, it cannot be altered without altering all subsequent blocks."
                        ]
                      },
                      {
                        "tag": "cybersecurity",
                        "patterns": ["What is cybersecurity?", "Tell me about cybersecurity", "How to protect against cyber attacks?", "What are cybersecurity threats?"],
                        "responses": [
                          "Cybersecurity is the practice of protecting systems, networks, and programs from digital attacks that aim to access, alter, or destroy data.",
                          "Common cybersecurity threats include phishing, malware, ransomware, and denial-of-service (DoS) attacks.",
                          "To protect against cyber threats, it's important to use strong passwords, enable two-factor authentication, and regularly update software and security patches."
                        ]
                      },
                      {
                        "tag": "quantum_computing",
                        "patterns": ["What is quantum computing?", "Tell me about quantum computers", "How does quantum computing work?", "What is the future of quantum computing?"],
                        "responses": [
                          "Quantum computing uses the principles of quantum mechanics to process information in fundamentally different ways compared to classical computers.",
                          "Quantum computers use quantum bits (qubits) that can exist in multiple states simultaneously, which allows them to solve complex problems much faster than classical computers.",
                          "Quantum computing could revolutionize fields like cryptography, drug discovery, and optimization problems. However, it’s still in the research and development stage."
                        ]
                      },
                      {
                        "tag": "5g_technology",
                        "patterns": ["What is 5G?", "Tell me about 5G technology", "How does 5G work?", "What are the benefits of 5G?"],
                        "responses": [
                          "5G is the fifth generation of mobile network technology, designed to provide faster speeds, higher capacity, and lower latency compared to 4G.",
                          "5G networks promise to enable advanced technologies like autonomous vehicles, smart cities, and the Internet of Things (IoT) on a global scale.",
                          "With 5G, download speeds can reach up to 10 Gbps, which is 100 times faster than 4G, enabling better streaming, gaming, and real-time applications."
                        ]
                      },
                      {
                        "tag": "virtual_reality",
                        "patterns": ["What is virtual reality?", "Tell me about VR technology", "How does virtual reality work?", "What are VR applications?"],
                        "responses": [
                          "Virtual reality (VR) is an immersive technology that creates a simulated environment that users can interact with using specialized equipment like VR headsets.",
                          "VR is used in gaming, training simulations, education, and even virtual tours. It can provide a sense of presence in environments like outer space or historical places.",
                          "In VR, users interact with 3D virtual worlds, and some systems use motion tracking to detect user movements, making the experience more interactive."
                        ]
                      },
                      {
                        "tag": "augmented_reality",
                        "patterns": ["What is augmented reality?", "Tell me about AR technology", "How does augmented reality work?", "What are AR applications?"],
                        "responses": [
                          "Augmented Reality (AR) overlays digital content onto the real world, typically viewed through devices like smartphones, tablets, or AR glasses.",
                          "AR is used in applications like Pokemon Go, Snapchat filters, and even in healthcare for surgery assistance and remote guidance.",
                          "AR enhances the real world by adding computer-generated elements, making it interactive and contextually relevant."
                        ]
                      },
                      {
                            "tag": "history",
                            "patterns": ["Tell me about history", "What is the history of the world?", "Give me a history lesson", "When did the World War II happen?"],
                            "responses": [
                              "History is the study of past events, particularly in human affairs. It spans everything from ancient civilizations to modern history.",
                              "World War II happened from 1939 to 1945 and involved most of the world’s nations. It was a major conflict between the Allies and the Axis powers.",
                              "Some key historical periods include the Renaissance, the Industrial Revolution, and the Cold War. Each marked significant changes in culture, technology, and society."
                            ]
                          },
                          {
                            "tag": "geography",
                            "patterns": ["Tell me about geography", "What is the capital of France?", "Where is the Eiffel Tower?", "Give me a geography quiz"],
                            "responses": [
                              "Geography is the study of the physical features of the Earth and its atmosphere, as well as human activity’s effect on these.",
                              "The capital of France is Paris, known for its landmarks like the Eiffel Tower and the Louvre Museum.",
                              "Geography also covers the study of landforms, climate, population distribution, and the impact of natural disasters."
                            ]
                          },
                          {
                            "tag": "science",
                            "patterns": ["What is science?", "Tell me about physics", "What is chemistry?", "Explain biology in simple terms"],
                            "responses": [
                              "Science is the systematic study of the structure and behavior of the physical and natural world through observation and experimentation.",
                              "Physics is the branch of science that deals with the structure of matter and how the fundamental components of the universe interact.",
                              "Chemistry is the science of substances and their properties, reactions, and interactions with other substances.",
                              "Biology is the study of living organisms, their structure, function, growth, and evolution."
                            ]
                          },
                          {
                            "tag": "famous_people",
                            "patterns": ["Tell me about Albert Einstein", "Who was Shakespeare?", "Tell me about famous scientists", "Who is the President of the United States?"],
                            "responses": [
                              "Albert Einstein was a theoretical physicist who developed the theory of relativity, one of the two pillars of modern physics.",
                              "William Shakespeare was an English playwright, poet, and actor, widely regarded as one of the greatest writers in the English language.",
                              "The President of the United States is Joe Biden, elected as the 46th president in 2020."
                            ]
                          },
                          {
                            "tag": "literature",
                            "patterns": ["Tell me about literature", "What is a novel?", "Who wrote '1984'?", "What is Shakespeare's most famous play?"],
                            "responses": [
                              "Literature is written works, especially those considered to have artistic or intellectual value.",
                              "A novel is a long narrative work of fiction. It is one of the most popular forms of literature.",
                              "'1984' was written by George Orwell and is a dystopian novel that critiques totalitarianism.",
                              "Shakespeare's most famous play is likely 'Hamlet', which explores themes of revenge, madness, and mortality."
                            ]
                          },
                          {
                            "tag": "sports",
                            "patterns": ["What is the history of football?", "Tell me about the Olympic Games", "What are the most popular sports?", "Who won the last World Cup?"],
                            "responses": [
                              "Football (soccer) has a rich history, with origins tracing back to ancient civilizations, but the modern version emerged in England in the mid-19th century.",
                              "The Olympic Games are a global event that includes a variety of sports, held every four years. The first modern Olympic Games were in 1896 in Athens, Greece.",
                              "Popular sports include football, basketball, cricket, tennis, and rugby. Each sport has a massive global following.",
                              "France won the 2018 FIFA World Cup, defeating Croatia 4-2 in the final."
                            ]
                          },
                          {
                            "tag": "space",
                            "patterns": ["Tell me about space", "What is a black hole?", "How far is the Moon?", "Who was the first person on the Moon?"],
                            "responses": [
                              "Space is the vast, seemingly infinite expanse that exists beyond Earth's atmosphere. It contains stars, planets, galaxies, and other celestial bodies.",
                              "A black hole is a region of space where the gravitational pull is so strong that nothing, not even light, can escape from it.",
                              "The Moon is about 384,400 kilometers (238,855 miles) away from Earth.",
                              "Neil Armstrong was the first person to walk on the Moon, doing so on July 20, 1969, during the Apollo 11 mission."
                            ]
                          },
                          {
                            "tag": "inventions",
                            "patterns": ["What is the most important invention?", "Who invented the telephone?", "Tell me about the lightbulb", "What are some famous inventions?"],
                            "responses": [
                              "The most important inventions include the wheel, the printing press, electricity, and the internet, all of which have radically changed human life.",
                              "The telephone was invented by Alexander Graham Bell in 1876, revolutionizing communication.",
                              "The lightbulb was perfected by Thomas Edison in 1879, providing a safe and reliable source of light.",
                              "Other famous inventions include the airplane (by the Wright brothers), the automobile (by Henry Ford), and the computer (by Charles Babbage and Alan Turing)."
                            ]
                          },
                          {
                            "tag": "famous_events",
                            "patterns": ["Tell me about the French Revolution", "What happened in 1776?", "What was the Industrial Revolution?", "What caused World War I?"],
                            "responses": [
                              "The French Revolution occurred from 1789 to 1799 and was a period of significant social and political upheaval in France, leading to the overthrow of the monarchy.",
                              "In 1776, the United States declared its independence from Great Britain, marking the beginning of the American Revolution.",
                              "The Industrial Revolution began in the late 18th century and saw the transition from agrarian economies to industrialized ones, revolutionizing manufacturing and society.",
                              "World War I, from 1914 to 1918, was caused by a combination of militarism, alliances, imperialism, and nationalism, with the assassination of Archduke Franz Ferdinand being the immediate trigger."
                            ]
                          },
                          {
                            "tag": "art",
                            "patterns": ["What is art?", "Tell me about famous artists", "Who painted the Mona Lisa?", "What are the different types of art?"],
                            "responses": [
                              "Art is a diverse range of human activities that involve creating visual, auditory, or performing artifacts, expressing the creator’s imagination or technical skill.",
                              "Famous artists include Leonardo da Vinci, Pablo Picasso, Vincent van Gogh, and Frida Kahlo, among many others.",
                              "The Mona Lisa was painted by Leonardo da Vinci and is one of the most famous paintings in the world.",
                              "Art forms include painting, sculpture, music, dance, theater, and film, with each providing different ways to express creativity."
                            ]
                          }                      
            
        ]
      
  